advanced/backend/controllers/HistoryController.php

    public function actionCreate()
    {
        $model = new History();

        if ($this->request->isPost) {
            if ($model->load($this->request->post()) && $model->save()) {
---
INSERT INTO `history` (`id`, `year`, `event_title`, `event_description`, `technology_impact`, `references`) VALUES (16, 1111, '', '', '', '')

    protected function findModel($id)
    {
        if (($model = History::findOne(['id' => $id])) !== null) {
---
SELECT * FROM `history` WHERE `id`='16'