advanced/backend/controllers/UsersController.php

SELECT * FROM `users` WHERE `Uid`='8'
---
    protected function findModel($Uid)
    {
        if (($model = Users::findOne(['Uid' => $Uid])) !== null) {