advanced/frontend/controllers/DomainController.php

    public function actionIndex()
    {
        // 查询领域数据，限制为10条记录
        $query = Domain::find();
        $pagination = new Pagination([
            'defaultPageSize' => 10,
            'totalCount' => $query->count(),
        ]);
        $domains = $query->orderBy('DomainID DESC')
                         ->offset($pagination->offset)
                         ->limit($pagination->limit)
                         ->all();
---
SELECT COUNT(*) FROM `domains`
SELECT * FROM `domains` ORDER BY `DomainID` DESC LIMIT 10