advanced/frontend/controllers/HistoryController.php

    public function actionIndex()
    {
        // 查询历史事件
        $query = History::find();

        // 分页设置
        $pagination = new Pagination([
            'defaultPageSize' => 5, // 每页显示 5 条数据
            'totalCount' => $query->count(),
        ]);

        // 查询结果，应用分页
        $histories = $query->orderBy('year')
            ->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();
---
SELECT COUNT(*) FROM `history`
SELECT * FROM `history` ORDER BY `year` LIMIT 5 OFFSET 10