advanced/frontend/controllers/PeopleController.php

SELECT * FROM `people`
---
      public function actionIndex($keyword = '')
      {
          // 如果提供了关键字，执行搜索
          $query = People::find();
          if ($keyword) {
              $query->where(['like', 'name', $keyword])
                    ->orWhere(['like', 'contributions', $keyword]);
          }
          $people = $query->all();

SELECT * FROM `people` WHERE (`name` LIKE '%图灵%') OR (`contributions` LIKE '%图灵%')
---
      public function actionSearch($keyword = '')
      {
          $query = People::find();

          // 如果提供了关键字，执行搜索
          if (!empty($keyword)) {
              $query->where(['like', 'name', $keyword])
                    ->orWhere(['like', 'contributions', $keyword]);
          }

          $people = $query->all();